app/views/user/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."anime_id" = ?  [["anime_id", 1]]
---
      <%= link_to user_anime_favorites_path(anime), method: :delete do %>
        ♥<%= anime.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."anime_id" = ?  [["anime_id", 2]]
---
    <%= link_to user_anime_favorites_path(anime), method: :post do %>
      ♡<%= anime.favorites.count %>