app/views/user/messages/index.html.erb

    <div class="col-7 mt-5">
      <% Message.all.each do |message| %>
---
SELECT "messages".* FROM "messages"