app/controllers/admin/animes_controller.rb

  def index
    animes = Anime.includes(:favorited_users).sort {|a,b| b.favorited_users.size <=> a.favorited_users.size}
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."anime_id" = ?  [["anime_id", 2]]
SELECT "animes".* FROM "animes"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."anime_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]

  def show
    @anime = Anime.find(params[:id])
    @anime_voices = AnimeVoice.where(anime_id: params[:id])
    @comments = Comment.where(anime_id: params[:id])
    @anime_url = AnimeUrl.new
    @anime_urls =AnimeUrl.where(anime_id: params[:id])
---
SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "anime_voices".* FROM "anime_voices" WHERE "anime_voices"."anime_id" = ?  [["anime_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."anime_id" = ?  [["anime_id", 3]]
SELECT "anime_urls".* FROM "anime_urls" WHERE "anime_urls"."anime_id" = ?  [["anime_id", 1]]

  def edit
    @anime = Anime.find(params[:id])
    @genres = Genre.all
---
SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"

  def update
    @anime = Anime.find(params[:id])
    if @anime.update(anime_params)
---
SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "animes" SET "title" = ?, "updated_at" = ? WHERE "animes"."id" = ?  [["title", "鬼滅の刃1"], ["updated_at", "2021-08-14 15:38:30.533402"], ["id", 1]]

  def destroy
    @anime = Anime.find(params[:id])
    @anime.destroy
---
SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "animes" WHERE "animes"."id" = ?  [["id", 3]]