app/controllers/admin/animes_controller.rb

SELECT  "animes".* FROM "animes" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
---
  def index
    @animes = Anime.all.page(params[:page]).per(15)