app/controllers/admin/anime_urls_controller.rb

  def create
    @anime_url = AnimeUrl.new(anime_url_params)
    if @anime_url.save
---
INSERT INTO "anime_urls" ("address", "created_at", "updated_at", "anime_id") VALUES (?, ?, ?, ?)  [["address", "https://kimetsu.com/anime/risshihen/"], ["created_at", "2021-08-19 10:53:55.581427"], ["updated_at", "2021-08-19 10:53:55.581427"], ["anime_id", 1]]

  def destroy
    @anime_url = AnimeUrl.find(params[:id])
    @anime_url.destroy
---
SELECT  "anime_urls".* FROM "anime_urls" WHERE "anime_urls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "anime_urls" WHERE "anime_urls"."id" = ?  [["id", 2]]