app/controllers/admin/anime_urls_controller.rb

SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @anime = Anime.find(params[:id])

SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @anime_url = AnimeUrl.new(anime_url_params)
    if @anime_url.save
      flash[:notice] = "投稿完了しました"
      redirect_back(fallback_location: root_path)
      # redirect_to admin_anime_path(params[:id])
    else
      @anime = Anime.find(params[:id])