app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "女性向けアニメ"], ["created_at", "2021-08-11 07:29:03.559413"], ["updated_at", "2021-08-11 07:29:03.559413"]]
---
  def create
    @genre = Genre.new(genre_params)
    if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "女性向けアニメ1"], ["updated_at", "2021-08-11 08:33:03.374719"], ["id", 2]]
---
  def update
    @genre = Genre.find(params[:id])
    if @genre.update(genre_params)

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]
---
  def destroy
    @genre = Genre.find(params[:id])
    @genre.destroy