app/controllers/admin/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.admin_id = current_admin.id
    if @message.save
---
INSERT INTO "messages" ("admin_id", "message_content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["admin_id", 1], ["message_content", "管理者テスト"], ["created_at", "2021-08-17 14:34:17.598025"], ["updated_at", "2021-08-17 14:34:17.598025"]]

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 3]]