app/controllers/admin/voices_controller.rb

  def index
    @voices = Voice.all
---
SELECT "voices".* FROM "voices"

  def show
    @voice = Voice.find(params[:id])
    # @anime_voices = @voice.anime_voices
    @anime_voices = AnimeVoice.where(voice_id: @voice.id)
---
SELECT  "voices".* FROM "voices" WHERE "voices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "anime_voices".* FROM "anime_voices" WHERE "anime_voices"."voice_id" = ?  [["voice_id", 1]]

  def create
    @voice = Voice.new(voice_params)
    if @voice.save
      flash[:notice] = "投稿完了しました"
      redirect_to admin_voices_path
    else
      @voices = Voice.all
---
INSERT INTO "voices" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "櫻井孝宏"], ["created_at", "2021-08-17 14:33:38.108694"], ["updated_at", "2021-08-17 14:33:38.108694"]]
SELECT "voices".* FROM "voices"

  def edit
    @voice = Voice.find(params[:id])
---
SELECT  "voices".* FROM "voices" WHERE "voices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @voice = Voice.find(params[:id])
    if @voice.update(voice_params)
---
SELECT  "voices".* FROM "voices" WHERE "voices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "voices" SET "name" = ?, "updated_at" = ? WHERE "voices"."id" = ?  [["name", "下野紘1"], ["updated_at", "2021-08-15 09:11:38.820214"], ["id", 1]]

  def destroy
    @voice = Voice.find(params[:id])
    @voice.destroy
---
SELECT  "voices".* FROM "voices" WHERE "voices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "voices" WHERE "voices"."id" = ?  [["id", 1]]