app/controllers/user/animes_controller.rb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."anime_id" = ?  [["anime_id", 1]]
SELECT "animes".* FROM "animes"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."anime_id" IN (?, ?, ?)  [["anime_id", 1], ["anime_id", 2], ["anime_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT  "genres".* FROM "genres" ORDER BY "genres"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    animes = Anime.includes(:favorited_users).sort {|a,b| b.favorited_users.size <=> a.favorited_users.size}
    @animes = Kaminari.paginate_array(animes).page(params[:page]).per(20)
    # @animes = Anime.all.page(params[:page]).per(15)
    @anime = Anime.new
    @genres = Genre.all

SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "voices".* FROM "voices"
SELECT "anime_voices".* FROM "anime_voices" WHERE "anime_voices"."anime_id" = ?  [["anime_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."anime_id" = ?  [["anime_id", 1]]
SELECT "anime_urls".* FROM "anime_urls" WHERE "anime_urls"."anime_id" = ?  [["anime_id", 2]]
---
  def show
    @anime = Anime.find(params[:id])
    @voices = Voice.all
    @voice = Voice.new
    @anime_voices = AnimeVoice.where(anime_id: params[:id])
    #@anime_voices = AnimeVoice.where(voice_id: params[:id])
    @comment = Comment.new
    @comments = Comment.where(anime_id: params[:id])
    @anime_urls =AnimeUrl.where(anime_id: params[:id])

INSERT INTO "animes" ("user_id", "genre_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["genre_id", 2], ["title", "ダイヤのA"], ["created_at", "2021-08-17 14:08:28.660005"], ["updated_at", "2021-08-17 14:08:28.660005"]]
---
  def create
    @anime = Anime.new(anime_params)
    if @anime.save