app/controllers/user/animes_controller.rb

  def index
    @animes = Anime.all.page(params[:page]).per(15)
---
SELECT  "animes".* FROM "animes" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]