app/controllers/user/comments_controller.rb

  def create
    # paramusは箱　リクエストの中身をparamsに入れている
    anime_id = params[:anime_id]
    @anime = Anime.find(anime_id)
    comment = current_user.comments.new(comment_params)
    comment.anime_id = anime_id
    comment.save
    # redirect_back(fallback_location: root_path)
    # redirect_to user_anime_path(@anime.id)
    @comments = Comment.where(anime_id: anime_id)
---
SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("anime_id", "user_id", "comment_content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["anime_id", 1], ["user_id", 1], ["comment_content", "テスト"], ["created_at", "2021-08-18 11:58:33.949666"], ["updated_at", "2021-08-18 11:58:33.949666"]]
SELECT "comments".* FROM "comments" WHERE "comments"."anime_id" = ?  [["anime_id", 1]]

  def destroy
    @anime = Anime.find(params[:anime_id])
    Comment.find_by(id: params[:id], anime_id: @anime.id).destroy
---
SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? AND "comments"."anime_id" = ? LIMIT ?  [["id", 1], ["anime_id", 1], ["LIMIT", 1]]