app/controllers/user/favorites_controller.rb

SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("anime_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["anime_id", 1], ["user_id", 1], ["created_at", "2021-08-17 09:15:30.197032"], ["updated_at", "2021-08-17 09:15:30.197032"]]
---
  def create
    @anime = Anime.find(params[:anime_id])
    @favorite = current_user.favorites.new(anime_id: @anime.id)
    @favorite.save

SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."anime_id" = ? LIMIT ?  [["user_id", 1], ["anime_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
    @anime = Anime.find(params[:anime_id])
    @favorite = current_user.favorites.find_by(anime_id: @anime.id)
    @favorite.destroy