app/controllers/user/messages_controller.rb

INSERT INTO "messages" ("user_id", "message_content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["message_content", "テスト"], ["created_at", "2021-08-15 10:10:01.325612"], ["updated_at", "2021-08-15 10:10:01.325612"]]
---
  def create
    @message = Message.new(message_params)
    if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]
---
  def destroy
    @message = Message.find(params[:id])
    @message.destroy