app/controllers/user/searches_controller.rb

  def search
    @value = params["search"]["value"]
    @datas = Anime.where(genre_id: @value).page(params[:page]).per(14)
    @genres = Genre.all
---
SELECT  "animes".* FROM "animes" WHERE "animes"."genre_id" = ? LIMIT ? OFFSET ?  [["genre_id", 1], ["LIMIT", 14], ["OFFSET", 0]]
SELECT COUNT(*) FROM "animes" WHERE "animes"."genre_id" = ?  [["genre_id", 1]]
SELECT "genres".* FROM "genres"