app/controllers/user/voices_controller.rb

SELECT "voices".* FROM "voices"
---
  def index
    @voices = Voice.all

SELECT  "voices".* FROM "voices" WHERE "voices"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "anime_voices".* FROM "anime_voices" WHERE "anime_voices"."voice_id" = ?  [["voice_id", 2]]
---
  def show
    @voice = Voice.find(params[:id])
    # @anime_voices = AnimeVoice.where(voice_id: params[:id])
    # findは１件、whereは複数件探してデータを持ってこられる
    @anime_voices = AnimeVoice.where(voice_id: @voice.id)

INSERT INTO "voices" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2021-08-17 12:23:34.642041"], ["updated_at", "2021-08-17 12:23:34.642041"]]
INSERT INTO "anime_voices" ("voice_id", "anime_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["voice_id", 6], ["anime_id", 1], ["created_at", "2021-08-17 14:20:38.723348"], ["updated_at", "2021-08-17 14:20:38.723348"]]
SELECT  "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    # user側からの声優の投稿は中間テーブルに入るようにするからモデル名はAnimeVoiceになる
    @voice = AnimeVoice.new(voice_params)
    if @voice.save
      flash.now[:notice] = "追加しました"
      # createしたら元のviewに戻る
      redirect_back(fallback_location: root_path)
    else
      @anime = Anime.find(params[:id])

SELECT  "anime_voices".* FROM "anime_voices" WHERE "anime_voices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "anime_voices" WHERE "anime_voices"."id" = ?  [["id", 1]]
---
  def destroy
    @voice = AnimeVoice.find(params[:id])
    @voice.destroy