app/views/admin/messages/index.html.erb

SELECT "messages".* FROM "messages"
---

      <% Message.all.each do |message| %>