app/views/user/comments/_index.html.erb

INSERT INTO "comments" ("anime_id", "user_id", "comment_content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["anime_id", 1], ["user_id", 1], ["comment_content", "yamada4"], ["created_at", "2021-08-18 08:43:02.025776"], ["updated_at", "2021-08-18 08:43:02.025776"]]
---
        <td>
          <%= comment.created_at.strftime('%Y/%m/%d') %>