app/views/user/animes/index.html.erb

            <div class="form-group">
              <%= f.collection_select :genre_id, Genre.all, :id, :name, {prompt: "選択してください"}%>
---
SELECT "genres".* FROM "genres"

                <!--      <%#= link_to user_anime_favorites_path(anime), method: :delete, remote: true do %>-->
                <!--        ♥<%#= anime.favorites.count %>-->
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."anime_id" = ?  [["anime_id", 1]]

                <!--      <%#= link_to user_anime_favorites_path(anime), method: :post, remote: true do %>-->
                <!--        ♡<%#= anime.favorites.count %>-->
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."anime_id" = ?  [["anime_id", 2]]

                <!--<%# else %>-->
                <!--  ♥<%#= anime.favorites.count %>-->
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."anime_id" = ?  [["anime_id", 1]]

              </td>
              <td><%= "#{anime.comments.count} コメント" %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."anime_id" = ?  [["anime_id", 1]]