app/views/user/animes/index.html.erb

              </td>
              <td><%= "#{anime.comments.count} コメント" %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."anime_id" = ?  [["anime_id", 1]]