app/views/admin/animes/index.html.erb

              </td>
              <td>&emsp;<%= "#{anime.comments.count} コメント" %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."anime_id" = ?  [["anime_id", 2]]