app/views/admin/animes/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."anime_id" = ?  [["anime_id", 1]]
---
        <%= @anime.title %>
        ♥<%= @anime.favorites.count %>